# !!! Программа должна выполняться на пониженной скорости.
# !!! Примерно30 inst/sec.

.text
        lui     t6 0xffff0          # база MMIO (старшие адреса)
        mv      t5 zero             # счётчик
        mv      t4 zero             # предыдущее значение
        li      t2 20               # Число нажатий до завершения программы
        li s11 0x80 # для обнуления выводимых цифр
loop:

	li a0, 1500
        li a7, 32  # Код системного вызова для задержки
        ecall
        
        
        #	тут обнулим цифры
	sb      s11 0x10(t6)         # запишем его в левое окошко
        sb      s11 0x11(t6)         # запишем результат в биты правого окошка


	
        mv      t1 zero             # общий результат сканирования
        li      t0 1                # первый ряд
        sb      t0 0x12(t6)         # сканируем
        lb      t0 0x14(t6)         # забираем результат
  
        or      t1 t1 t0            # добавляем биты в общий результат
        li      t0 2                # второй ряд
        sb      t0 0x12(t6)
        lb      t0 0x14(t6)
        or      t1 t1 t0
        li      t0 4                # третий ряд
        sb      t0 0x12(t6)
        lb      t0 0x14(t6)
        or      t1 t1 t0
        li      t0 8                # четвёртый ряд
        sb      t0 0x12(t6)
        lb      t0 0x14(t6)
        or      t1 t1 t0
        
        beq     t1 t4 same
        
        #	тут супер хард-код
        li s0 17 # 0
        bne s0 t1 next1
        li t1 0x3f
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next1:
        li s0 33 # 1
        bne s0 t1 next2
        li t1 0x06
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next2:
        li s0 65 # 2
        bne s0 t1 next3
        li t1 0x5b
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next3:
        li s0 -127 # 3
        bne s0 t1 next4
        li t1 0x4f
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next4:
        li s0 0x12 # 4
        bne s0 t1 next5
        li t1 0x66
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next5:
        li s0 34 # 5
        bne s0 t1 next6
        li t1 0x6d
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next6:
        li s0 66 # 6
        bne s0 t1 next7
        li t1 0x7d
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next7:
        li s0 -126 # 7
        bne s0 t1 next8
        li t1 0x07
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next8:
        li s0 20 # 8
        bne s0 t1 next9
        li t1 0x7f
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next9:
        li s0 36 # 9
        bne s0 t1 next10
        li t1 0x6f
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next10:
        li s0 68 # a
        bne s0 t1 next11
        li s1 0x06
        li t1 0x3f
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next11:
        li s0 -124 # b
        bne s0 t1 next12
        li s1 0x06
        li t1 0x06
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next12:
        li s0 24 # c
        bne s0 t1 next13
        li s1 0x06
        li t1 0x5b
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next13:
        li s0 40 # d
        bne s0 t1 next14
        li s1 0x06
        li t1 0x4f
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next14:
        li s0 72 # e
        bne s0 t1 next15
        li s1 0x06
        li t1 0x66
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
      	next15:
      	li s0 -120 # f
      	bne s0 t1 loop
        li s1 0x06
        li t1 0x6d
        sb      s1 0x11(t6)         # запишем его в левое окошко
        sb      t1 0x10(t6)         # запишем результат в биты правого окошка
 
        addi    t5 t5 1             # счётчик
        
        
        mv      t4 t1
same:   ble     t5 t2 loop

        li      a7 10
        ecall
